export const mockedData = [
    {
        type: 'Сахарный диабет 2 типа',
        value: 31,
    },
    {
        type: 'Инфаркт',
        value: 26,
    },
    {
        type: 'Инсульт',
        value: 23,
    },
    {
        type: 'Ишемическая болезнь сердца',
        value: 21,
    },
    {
        type: 'Хроническая болезнь почек',
        value: 18,
    },
    {
        type: 'Артериальная гипертония',
        value: 13,
    },
    {
        type: 'Атеросклероз',
        value: 8,
    },
    {
        type: 'Другие заболевания сердечно-сосудистой системы',
        value: 3,
    },
];
