export const mockedDataCitiesChart = [
    {
        type: 'Москва',
        value: 132,
    },
    {
        type: 'Санкт-Петербург',
        value: 89,
    },
    {
        type: 'Севастополь',
        value: 32,
    },
    {
        type: 'Республика Адыгея',
        value: 42,
    },
    {
        type: 'Республика Алтай',
        value: 54,
    },
    {
        type: 'Республика Башкортостан',
        value: 23,
    },
    {
        type: 'Республика Бурятия',
        value: 14,
    },
    {
        type: 'Республика Дагестан',
        value: 23,
    },
    {
        type: 'Донецкая Народная Республика',
        value: 38,
    },
    {
        type: 'Республика Ингушетия',
        value: 43,
    },
    {
        type: 'Кабардино-Балкарская Республика',
        value: 32,
    },
    {
        type: 'Республика Калмыкия',
        value: 65,
    },
    {
        type: 'Карачаево-Черкесская Республика',
        value: 16,
    },
    {
        type: 'Республика Карелия',
        value: 41,
    },
    {
        type: 'Республика Коми',
        value: 39,
    },
    {
        type: 'Республика Крым',
        value: 23,
    },
    {
        type: 'Луганская Народная Республика',
        value: 37,
    },
    {
        type: 'Республика Марий Эл',
        value: 41,
    },
    {
        type: 'Республика Мордовия',
        value: 52,
    },
    {
        type: 'Республика Саха (Якутия)',
        value: 26,
    },
    {
        type: 'Республика Северная Осетия — Алания',
        value: 12,
    },
    {
        type: 'Республика Татарстан',
        value: 36,
    },
    {
        type: 'Республика Тыва',
        value: 31,
    },
    {
        type: 'Удмуртская Республика',
        value: 23,
    },
    {
        type: 'Республика Хакасия',
        value: 28,
    },
    {
        type: 'Чеченская Республика',
        value: 43,
    },
    {
        type: 'Чувашская Республика — Чувашия',
        value: 21,
    },
    {
        type: 'Алтайский край',
        value: 12,
    },
    {
        type: 'Забайкальский край',
        value: 35,
    },
    {
        type: 'Камчатский край',
        value: 24,
    },
    {
        type: 'Краснодарский край',
        value: 18,
    },
    {
        type: 'Красноярский край',
        value: 25,
    },
    {
        type: 'Пермский край',
        value: 42,
    },
    {
        type: 'Приморский край',
        value: 35,
    },
    {
        type: 'Ставропольский край',
        value: 22,
    },
    {
        type: 'Хабаровский край',
        value: 21,
    },
    {
        type: 'Амурская область',
        value: 11,
    },
    {
        type: 'Архангельская область',
        value: 18,
    },
    {
        type: 'Астраханская область',
        value: 31,
    },
    {
        type: 'Белгородская область',
        value: 51,
    },
    {
        type: 'Брянская область',
        value: 21,
    },
    {
        type: 'Владимирская область',
        value: 15,
    },
    {
        type: 'Волгоградская область',
        value: 12,
    },
    {
        type: 'Вологодская область',
        value: 47,
    },
    {
        type: 'Воронежская область',
        value: 41,
    },
    {
        type: 'Запорожская область',
        value: 36,
    },
    {
        type: 'Ивановская область',
        value: 28,
    },
    {
        type: 'Иркутская область',
        value: 36,
    },
    {
        type: 'Калининградская область',
        value: 19,
    },
    {
        type: 'Калужская область',
        value: 21,
    },
    {
        type: 'Кемеровская область — Кузбасс',
        value: 12,
    },
    {
        type: 'Кировская область',
        value: 19,
    },
    {
        type: 'Костромская область',
        value: 3,
    },
    {
        type: 'Курганская область',
        value: 27,
    },
    {
        type: 'Курская область',
        value: 42,
    },
    {
        type: 'Ленинградская область',
        value: 22,
    },
    {
        type: 'Липецкая область',
        value: 27,
    },
    {
        type: 'Магаданская область',
        value: 35,
    },
    {
        type: 'Московская область',
        value: 14,
    },
    {
        type: 'Мурманская область',
        value: 18,
    },
    {
        type: 'Нижегородская область',
        value: 22,
    },
    {
        type: 'Новгородская область',
        value: 54,
    },
    {
        type: 'Новосибирская область',
        value: 47,
    },
    {
        type: 'Омская область',
        value: 56,
    },
    {
        type: 'Оренбургская область',
        value: 43,
    },
    {
        type: 'Орловская область',
        value: 21,
    },
    {
        type: 'Пензенская область',
        value: 15,
    },
    {
        type: 'Псковская область',
        value: 27,
    },
    {
        type: 'Ростовская область',
        value: 31,
    },
    {
        type: 'Рязанская область',
        value: 46,
    },
    {
        type: 'Самарская область',
        value: 34,
    },
    {
        type: 'Саратовская область',
        value: 36,
    },
    {
        type: 'Сахалинская область',
        value: 26,
    },
    {
        type: 'Свердловская область',
        value: 13,
    },
    {
        type: 'Смоленская область',
        value: 50,
    },
    {
        type: 'Тамбовская область',
        value: 25,
    },
    {
        type: 'Тверская область',
        value: 29,
    },
    {
        type: 'Томская область',
        value: 15,
    },
    {
        type: 'Тульская область',
        value: 23,
    },
    {
        type: 'Тюменская область',
        value: 32,
    },
    {
        type: 'Ульяновская область',
        value: 18,
    },
    {
        type: 'Херсонская область',
        value: 36,
    },
    {
        type: 'Челябинская область',
        value: 43,
    },
    {
        type: 'Ярославская область',
        value: 47,
    },
    {
        type: 'Еврейская АО',
        value: 32,
    },
    {
        type: 'Ненецкий АО',
        value: 44,
    },
    {
        type: 'Ханты-Мансийский АО — Югра',
        value: 31,
    },
    {
        type: 'Чукотский АО',
        value: 24,
    },
    {
        type: 'Ямало-Ненецкий АО',
        value: 14,
    },
];

export const mockedDataRiskGroupChart = [
    {
        type: 'Низкий риск',
        value: 35,
    },
    {
        type: 'Умеренный риск',
        value: 29,
    },
    {
        type: 'Высокий риск',
        value: 27,
    },
    {
        type: 'Очень высокий риск',
        value: 9,
    },
];

export const mockedDataDiseasesChart = [
    {
        type: 'Сахарный диабет 2 типа',
        value: 31,
    },
    {
        type: 'Инфаркт',
        value: 26,
    },
    {
        type: 'Инсульт',
        value: 23,
    },
    {
        type: 'Ишемическая болезнь сердца',
        value: 21,
    },
    {
        type: 'Хроническая болезнь почек',
        value: 18,
    },
    {
        type: 'Артериальная гипертония',
        value: 13,
    },
    {
        type: 'Атеросклероз',
        value: 8,
    },
    {
        type: 'Другие заболевания сердечно-сосудистой системы',
        value: 3,
    },
];

export const mockedDataPressure = [
    {
        type: '80-114 мм.рт.ст.',
        value: 15,
    },
    {
        type: '115-149 мм.рт.ст.',
        value: 30,
    },
    {
        type: '150-184 мм.рт.ст.',
        value: 30,
    },
    {
        type: '185-219 мм.рт.ст.',
        value: 15,
    },
    {
        type: '220-250 мм.рт.ст.',
        value: 10,
    },
];
