import { IHelpData } from '../components/types';

export const diseaseTitle = 'Заболевания';
export const basicIndicationsTitle = 'Базовые показатели';
export const complexIndicationsTitle = 'Комплексные показатели';

export const COMMON_TAB = 'common';
export const SUMMARY_TAB = 'summary';
export const TEAM_TAB = 'team';

export const disease: IHelpData[] = [
  {
    name: 'Хроническая болезнь почек',
    description: 'Прогрессирующее повреждение ткани почек, которое с течением времени приводит к ухудшению их функции, такой как фильтрация крови и удаление отходов из организма. ХБП может быть вызвана различными причинами, включая высокое кровяное давление, диабет, воспаление почек и другие заболевания. ХБП является необратимым процессом и может прогрессировать до того, как почки полностью потеряют свою функцию, что требует диализа или трансплантации почки.',
    colors: null
  },
  {
    name: 'Артериальная гипертония',
    description: 'Состояние, при котором давление крови в артериях постоянно повышено. Это может привести к повреждению сосудов и органов, таких как сердце, почки и мозг, и увеличить риск сердечно-сосудистых заболеваний. Артериальная гипертония может быть вызвана различными факторами, такими как генетика, увеличение веса, недостаточная физическая активность и стресс. Лечение может включать изменение образа жизни и принятие лекарств.',
    colors: null
  },
  {
    name: 'Ишемическая болезнь сердца',
    description: 'Состояние, вызванное сужением артерий, которые поставляют кровь и кислород к сердцу. Это может привести к болевым ощущениям в груди, затруднению дыхания, усталости и другим симптомам. ИБС обычно вызывается образом жизни, таким как курение, неправильное питание, недостаточная физическая активность и стресс. Лечение может включать изменение образа жизни, принятие лекарств и иногда процедуры, такие как ангиопластика и шунтирование коронарных артерий.',
    colors: null
  },
  {
    name: 'Сахарный диабет 2 типа',
    description: 'Заболевание, при котором уровень сахара (глюкозы) в крови постоянно повышен, потому что организм не производит достаточно инсулина или не может правильно использовать инсулин. Это может привести к ряду проблем со здоровьем, таких как проблемы с сердечно-сосудистой системой, нервной системой, глазами и почками. Сахарный диабет 2 типа связан с факторами риска, такими как наследственность, возраст, недостаток физической активности, неправильное питание и избыточный вес. Лечение может включать изменение образа жизни, принятие лекарств и иногда инсулинотерапию.',
    colors: null
  },
  {
    name: 'Инфаркт миокарда',
    description: 'Состояние, при котором часть сердечной мышцы умирает из-за недостаточного кровоснабжения. Это происходит, когда артерия, поставляющая кровь в сердце, заблокирована тромбом или атеросклеротическим налетом.',
    colors: null
  },
  {
    name: 'Инсульт',
    description: 'Состояние, при котором кровоснабжение к части мозга нарушено, что приводит к повреждению мозговых клеток. Это может произойти из-за заболеваний артерий или сосудов, которые поставляют кровь в мозг, или из-за кровоизлияния в мозг.',
    colors: null
  },
  {
    name: 'Атеросклероз',
    description: 'Заболевание, при котором на стенках артерий образуются жировые отложения, что может привести к сужению и закупорке артерий и проблемам со здоровьем. Факторы риска включают курение, высокий уровень холестерина, высокое кровяное давление, диабет и недостаток физической активности. Лечение может включать изменение образа жизни, лекарства и процедуры.',
    colors: null
  },
  {
    name: 'Стенокардия',
    description: 'Заболевание, которое характеризуется приступами боли в груди, вызванными недостаточным кровоснабжением сердечной мышцы. Это обычно происходит, когда артерии, которые поставляют кровь в сердце, становятся узкими или заблокированными атеросклеротическими бляшками. Стенокардия может быть вызвана физической нагрузкой, эмоциональным стрессом или другими факторами, которые увеличивают потребность сердца в крови и кислороде. Лечение стенокардии может включать лекарства, изменения образа жизни и процедуры, направленные на восстановление кровотока в сердце, такие как ангиопластика или шунтирование коронарных артерий.',
    colors: null
  }
];

export const basicIndications: IHelpData[] = [
  {
    name: 'Индекс массы тела',
    description: 'Показатель, который используется для оценки степени ожирения человека. Он рассчитывается путем деления массы тела в килограммах на квадрат высоты в метрах.',
    colors: [
      { label: 'от 10 до 18,5', color: 'красный', type: 'danger', id: 1 },
      { label: 'от 18,5 до 25', color: 'зеленый', type: 'success', id: 2 },
      { label: 'от 25 до 50', color: 'красный', type: 'danger', id: 3 }
    ]
  },
  {
    name: 'Уровень систолического артериального давления',
    description: 'Показатель наибольшего давления крови в артериях при сокращении сердца. Он измеряется в мм рт. ст. и является одним из двух чисел, которые используются для определения уровня артериального давления в целом, вместе с уровнем диастолического АД.',
    colors: [
      { label: 'от 60 до 100', color: 'красный', type: 'danger', id: 1 },
      { label: 'от 100 до 130', color: 'зеленый', type: 'success', id: 2 },
      { label: 'от 130 до 210', color: 'красный', type: 'danger', id: 3 }
    ]
  },
  {
    name: 'Общий холестерин',
    description: 'Показатель, который отражает общее количество холестерина в крови. Холестерин – это вещество, необходимое для нормального функционирования организма, но избыток холестерина может стать фактором риска развития сердечно-сосудистых заболеваний. Общий холестерин включает в себя липопротеины низкой плотности (ЛПНП, или "плохой холестерин"), липопротеины высокой плотности (ЛПВП, или "хороший холестерин") и другие формы холестерина.',
    colors: [
      { label: 'от 0,4 до 2,8 мМоль/л', color: 'красный', type: 'danger', id: 1 },
      { label: 'от 2,8 до 5,2 мМоль/л', color: 'зеленый', type: 'success', id: 2 },
      { label: 'от 5,2 до 15 мМоль/л', color: 'красный', type: 'danger', id: 3 }
    ]
  }
];

export const complexIndications: IHelpData[] = [
  {
    name: 'Холестерин высокой плотности (ЛПВП)',
    description: 'Форма холестерина, которая считается "хорошим" холестерином, поскольку она помогает удалить избыток холестерина из крови, предотвращая его отложение на стенках артерий. ЛПВП транспортирует холестерин из тканей и органов обратно в печень для его обработки и вывода из организма. Высокий уровень ЛПВП в крови считается благоприятным фактором для здоровья сердца и сосудов, поскольку это может помочь предотвратить развитие атеросклероза и других сердечно-сосудистых заболеваний. Хорошим способом повышения уровня ЛПВП являются физические упражнения и здоровый образ жизни.',
    colors: [
      { label: 'от 0,1 до 0,72 мМоль/л', color: 'красный', type: 'danger', id: 1 },
      { label: 'от 0,72 до 2,38 мМоль/л', color: 'зеленый', type: 'success', id: 2 },
      { label: 'от 2,38 до 7,2 мМоль/л', color: 'красный', type: 'danger', id: 3 }
    ]
  },
  {
    name: 'Холестерин низкой плотности (ЛПНП)',
    description: 'Форма холестерина, которая считается "плохим" холестерином, поскольку она может откладываться на стенках артерий, формируя атеросклеротические бляшки и повышая риск развития сердечно-сосудистых заболеваний. ЛПНП переносит холестерин из печени в ткани и органы, где он используется для образования новых клеток и тканей. Высокий уровень ЛПНП в крови считается неблагоприятным фактором для здоровья сердца и сосудов, поскольку он может способствовать развитию атеросклероза и других сердечно-сосудистых заболеваний. Лечение повышенного уровня ЛПНП может включать изменения образа жизни, такие как здоровое питание и физические упражнения, а также лекарственные препараты.',
    colors: [
      { label: 'от 0,14 до 1,76 мМоль/л', color: 'красный', type: 'danger', id: 1 },
      { label: 'от 1,76 до 5,72 мМоль/л', color: 'зеленый', type: 'success', id: 2 },
      { label: 'от 5,72 до 14,8 мМоль/л', color: 'красный', type: 'danger', id: 3 }
    ]
  },
  {
    name: 'Триглицериды',
    description: 'Тип жирных кислот, который является основным компонентом жировых отложений в тканях и в крови. Они являются источником энергии для организма, но при избыточном уровне могут увеличивать риск развития сердечно-сосудистых заболеваний, таких как атеросклероз. Высокий уровень триглицеридов в крови может быть связан с ожирением, сахарным диабетом, алкоголизмом и другими факторами риска. Уровень триглицеридов может быть контролируем с помощью здорового образа жизни, такого как правильное питание и физические упражнения, а также лекарственных препаратов.',
    colors: [
      { label: 'от 0,03 до 0,2 мМоль/л', color: 'красный', type: 'danger', id: 1 },
      { label: 'от 0,2 до 1,7 мМоль/л', color: 'зеленый', type: 'success', id: 2 },
      { label: 'от 1,7 до 6,9 мМоль/л', color: 'красный', type: 'danger', id: 3 }
    ]
  },
  {
    name: 'Липопротеин',
    description: 'Комплексы белков и липидов, которые транспортируют жирные кислоты, холестерол и другие липиды в крови от места их синтеза к местам их использования. Существует несколько типов липопротеинов, таких как ЛПНП (холестерин низкой плотности), ЛПВП (холестерин высокой плотности) и триглицериды. Уровень и соотношение различных типов липопротеинов в крови могут быть связаны с риском развития сердечно-сосудистых заболеваний. Контроль уровня липопротеинов в крови может быть достигнут с помощью здорового образа жизни и лекарственных препаратов.',
    colors: [
      { label: 'от 0,01 до 0,3 г/л', color: 'зеленый', type: 'success', id: 1 },
      { label: 'от 0,3 до 0,9 г/л', color: 'красный', type: 'danger', id: 2 }
    ]
  },
  {
    name: 'Высокочувствительный С-реактивный белок (кардио)',
    description: 'Белок, который вырабатывается в ответ на воспалительные процессы в организме. Он может быть использован как маркер воспаления, который связан с риском развития сердечно-сосудистых заболеваний, таких как инфаркт миокарда и инсульт. Высокие уровни С-реактивного белка могут быть связаны с некоторыми факторами риска, такими как ожирение, курение, артериальная гипертензия и диабет. Контроль уровня С-реактивного белка может помочь в диагностике и лечении сердечно-сосудистых заболеваний.',
    colors: [
      { label: 'от 0,1 до 5 мг/л', color: 'зеленый', type: 'success', id: 1 },
      { label: 'от 5 до 15,3 мг/л', color: 'красный', type: 'danger', id: 2 }
    ]
  },
  {
    name: 'Коэффициент атерогенности',
    description: 'Отношение уровня общего холестерина к уровню холестерина высокой плотности (ЛПВП) в крови. ЛПВП иногда называют "хорошим" холестерином, потому что они помогают удалять лишний холестерин из крови. Чем ниже уровень ЛПВП и выше уровень общего холестерина, тем выше коэффициент атерогенности, что может свидетельствовать о повышенном риске сердечно-сосудистых заболеваний.',
    colors: [
      { label: 'от 0,1 до 3', color: 'красный', type: 'danger', id: 1 },
      { label: 'от 2 до 3', color: 'зеленый', type: 'success', id: 2 },
      { label: 'от 3 до 7', color: 'красный', type: 'danger', id: 3 }
    ]
  },
  {
    name: 'Креатинин',
    description: 'Продукт метаболизма креатина, который образуется в мышцах и выделяется через почки. Уровень креатинина в крови используется для оценки функции почек, поскольку почки фильтруют креатинин из крови. Если функция почек нарушена, уровень креатинина в крови может повышаться. Поэтому креатинин является важным маркером функции почек и используется в диагностике и мониторинге почечной недостаточности.',
    colors: [
      { label: 'от 12 до 44 мкМоль/л', color: 'красный', type: 'danger', id: 1 },
      { label: 'от 44 до 115 мкМоль/л', color: 'зеленый', type: 'success', id: 2 },
      { label: 'от 115 до 194 мкМоль/л', color: 'красный', type: 'danger', id: 3 }
    ]
  }
];
